notes/meeting_2021may30.org
* meeting notes May 16, 2021
** agenda
*** raku classes as data containers (postponed) (joe brenner) 
**** https://github.com/doomvox/raku-study/tree/main/bin/2021apr25/data_container_class.raku
*** find/grep variants in raku revisited (joe brenner)

*** bruce gray rosettacode
**** http://rosettacode.org/wiki/Coprime_triplets#Raku
**** https://rosettacode.org/wiki/Tree_from_nesting_levels#Raku 

*** argument passing signatures (joe brenner)
**** /home/doom/End/Cave/Ice/Xtal/Perl6/passing_args.org
**** /home/doom/End/Cave/Perl6/Wall/raku-study/bin/2021may02/mixing_named_args_and_positional_ones.raku

*** super flat 
**** https://stackoverflow.com/questions/67515479/what-is-a-simple-and-elegant-way-to-flatten-lists-or-arrays-of-arbitrary-depths
**** https://stackoverflow.com/questions/41648119/how-can-i-completely-flatten-a-list-of-lists-of-lists
**** https://en.wikipedia.org/wiki/Superflat
**** a job for flat? 
***** https://stackoverflow.com/questions/67373726/why-are-empty-raku-shaped-arrays-truthy
"As a follow up, I wonder if a good way to test 'all elements are undefined' is @shaped-array.any.so ???"

****** bruce gray suggests just using none:
#+BEGIN_SRC perl6
    my @a =   Any xx 3;
    my @b = |(Any xx 2), 0;
    say .raku for :@a, :@b;  
     ## :a([Any, Any, Any])
     ## :b([Any, Any, 0])
    say @a.none.defined.so;  # True
    say @b.none.defined.so;  # False
#+END_SRC

*** type system: what is accepted by what   
**** is anything ever cast automatically
***** when can you Cool

*** go through my perl5 templates: how much is core raku now?

